app/views/contas/_form.html.erb

    <%= f.label :relatorio_id %><br />
    <%= f.collection_select(:relatorio_id, Relatorio.order(:ano), :id, :print_month, {:prompt => true}) %>
---
SELECT "relatorios".* FROM "relatorios" ORDER BY ano