app/views/relatorios/show.html.erb

SELECT "contas".* FROM "contas" WHERE ("contas".relatorio_id = 1)
---
<% saida = 0.0 -%>
<% @relatorio.contas.each do |conta|-%>