app/controllers/contas_controller.rb

SELECT "contas".* FROM "contas"
---
  def index
    @contas = Conta.all

SELECT "contas".* FROM "contas" WHERE "contas"."id" = 1 LIMIT 1
---
  def show
    @conta = Conta.find(params[:id])

SELECT "contas".* FROM "contas" WHERE "contas"."id" = 1 LIMIT 1
---
  def edit
    @conta = Conta.find(params[:id])

INSERT INTO "contas" ("nome", "valor", "relatorio_id", "created_at", "updated_at") VALUES ('Energia', 24.59, 1, '2011-08-08 14:38:56.383825', '2011-08-08 14:38:56.383825')
---
  def create
    @conta = Conta.new(params[:conta])

    respond_to do |format|
      if @conta.save

SELECT "contas".* FROM "contas" WHERE "contas"."id" = 2 LIMIT 1
DELETE FROM "contas" WHERE "contas"."id" = 2
---
  def destroy
    @conta = Conta.find(params[:id])
    @conta.destroy