app/controllers/relatorios_controller.rb

SELECT "relatorios".* FROM "relatorios"
---
  def index
    @relatorios = Relatorio.all

SELECT "relatorios".* FROM "relatorios" WHERE "relatorios"."id" = 1 LIMIT 1
---
  def show
    @conta = Conta.new
    @relatorio = Relatorio.find(params[:id])

SELECT "relatorios".* FROM "relatorios" WHERE "relatorios"."id" = 1 LIMIT 1
---
  def edit
    @relatorio = Relatorio.find(params[:id])

INSERT INTO "relatorios" ("mes", "ano", "saldo_mes_anterior", "dizimos", "ofertas", "created_at", "updated_at") VALUES ('2011-08-01', '2011-08-08', 100.0, 100.0, 100.0, '2011-08-08 14:36:43.123744', '2011-08-08 14:36:43.123744')
---
  def create
    @relatorio = Relatorio.new(params[:relatorio])

    respond_to do |format|
      if @relatorio.save

SELECT "relatorios".* FROM "relatorios" WHERE "relatorios"."id" = 1 LIMIT 1
UPDATE "relatorios" SET "saldo_mes_anterior" = 200.0, "updated_at" = '2011-08-10 14:13:33.892091' WHERE "relatorios"."id" = 1
---
  def update
    @relatorio = Relatorio.find(params[:id])

    respond_to do |format|
      if @relatorio.update_attributes(params[:relatorio])